IF OBJECT_ID('tempdb..#my_temp_test_codes') IS NOT NULL
BEGIN
    DROP TABLE #my_temp_test_codes
END

CREATE TABLE #my_temp_test_codes (Код_теста VARCHAR(255), ColumnName VARCHAR(255), rn INT);

INSERT INTO #my_temp_test_codes (Код_теста, ColumnName, rn)
VALUES 
('Э0008', 'Тропонин_1', 1), ('Х0040', 'Тропонин_1', 1), ('ПЭ0121', 'Тропонин_1', 1), ('Х0037', 'Тропонин_1', 1), ('Л0001', 'Тропонин_1', 1), ('ПЭ0140', 'Тропонин_1', 1),
('Э0008', 'Тропонин_2', 2), ('Х0040', 'Тропонин_2', 2), ('ПЭ0121', 'Тропонин_2', 2), ('Х0037', 'Тропонин_2', 2), ('Л0001', 'Тропонин_2', 2), ('ПЭ0140', 'Тропонин_2', 2),
('Б0050', 'ЛПВП', 1), ('ЛБ0030', 'ЛПВП', 1), ('ПЭ0030', 'ЛПВП', 1), ('Э0079', 'ЛПВП', 1),
('ПЭ0031', 'ЛПОНП', 1), ('Б0058', 'ЛПОНП', 1), ('ЛБ0055', 'ЛПОНП', 1), ('Э0081', 'ЛПОНП', 1),
('Э0082', 'ЛПНП', 1), ('ПЭ0029', 'ЛПНП', 1), ('Б0054', 'ЛПНП', 1), ('Б1033', 'ЛПНП', 1), ('ЛБ0031', 'ЛПНП', 1),
('Б0018', 'ХС_общ', 1), ('ПЭ0014', 'ХС_общ', 1), ('Э0078', 'ХС_общ', 1), ('ЛБ0028', 'ХС_общ', 1), ('Д0115', 'ХС_общ', 1),
('ЛБ0051', 'СКФ', 1), ('ЛБ0067', 'СКФ', 1), ('Б0087', 'СКФ', 1), ('Б1022', 'СКФ', 1), ('Б0121', 'СКФ', 1),
('Э0053', 'креат', 1), ('ЛБ0051', 'креат', 1), ('Б0016', 'креат', 1), ('ПЭ0015', 'креат', 1),
('Б0072', 'СРБ', 1), ('Э0054', 'СРБ', 1), ('ПЭ0024', 'СРБ', 1), ('ЛБ0032', 'СРБ', 1), ('М0500', 'СРБ', 1), ('Д0037', 'СРБ', 1),
('ЛБ0008', 'Глюкоза', 1), ('ПЭ0006', 'Глюкоза', 1), ('Б0030', 'Глюкоза', 1), ('Д0009', 'Глюкоза', 1),
('Г0064', 'Баз_абс', 1), ('Г0102', 'Баз_абс', 1), 
('Г0052', 'Баз_отн', 1), ('Г0100', 'Баз_отн', 1), ('П0010', 'Баз_отн', 1),
('Г0060', 'Эоз_абс', 1), ('Г0098', 'Эоз_абс', 1), 
('Г0096', 'Эоз_отн', 1), ('П0009', 'Эоз_отн', 1), ('К0099', 'Эоз_отн', 1), ('Г0050', 'Эоз_отн', 1),
('Г0040', 'Моно_абс', 1), ('Г0062', 'Моно_абс', 1), 
('Г0028', 'Моно_отн', 1), ('Г0030', 'Моно_отн', 1), ('О0186', 'Моно_отн', 1), ('К0101', 'Моно_отн', 1), ('П0008', 'Моно_отн', 1), ('ПЭ0155', 'Моно_отн', 1), ('Г0017', 'Моно_отн', 1), ('Д0127', 'Моно_отн', 1),
('00346', 'Лимф_абс', 1), ('Г0058', 'Лимф_абс', 1), ('Г0038', 'Лимф_абс', 1), 
('Г0026', 'Лимф_отн', 1), ('Г0013', 'Лимф_отн', 1), ('Г0024', 'Лимф_отн', 1), ('ПЭ0156', 'Лимф_отн', 1), ('О0187', 'Лимф_отн', 1), ('М0050', 'Лимф_отн', 1),
('Г0042', 'нейтр_абс', 1), 
('П0006', 'нейтр_отн', 1), ('Г0034', 'нейтр_отн', 1), ('Д0125', 'нейтр_отн', 1), ('ПЭ0154', 'нейтр_отн', 1),
('Г0002', 'WBC', 1), 
('Г0022', 'PCT', 1), 
('Г0018', 'PDW', 1), 
('Г0020', 'MPV', 1),
('Г0016', 'PLT', 1), 
('ЛГ0003', 'RDW_SD', 1), 
('Г0014', 'RDW', 1), 
('Г0006', 'HCT', 1),
('Г0012', 'MCHC', 1),
('Г0010', 'MCH', 1),
('Г0008', 'MCV', 1),
('Г0000', 'RBC', 1),
('Г0004', 'Hb', 1)

WITH cte AS (
    SELECT 
        Пациент_хэш,
        Статус,
        1 AS Value
    FROM almaz_wh.dbo.obj_usluga293_wh
    WHERE Статус IN ('ЭХОКАРДИОГРАФИЧЕСКОЕ ИССЛЕДОВАНИЕ РЕЗУЛЬТАТ', 'ПРОТОКОЛ ОПЕРАЦИИ', 'ЭКГ РЕЗУЛЬТАТ', 'ОСМОТР БОЛЬНОГО АНЕСТЕЗИОЛОГОМ-РЕАНИМАТОЛОГОМ', 'КОРОНАРОГРАФИЯ РЕЗУЛЬТАТ', 'ДИАГНОЗ СТАЦИОНАРНЫЙ')
),

status_pivot AS (
    SELECT *
    FROM (
        SELECT Пациент_хэш, Статус, Value
        FROM cte
    ) AS SourceTable
    PIVOT (
        MAX(Value)
        FOR Статус IN ([ЭХОКАРДИОГРАФИЧЕСКОЕ ИССЛЕДОВАНИЕ РЕЗУЛЬТАТ], [ПРОТОКОЛ ОПЕРАЦИИ], [ЭКГ РЕЗУЛЬТАТ], [ОСМОТР БОЛЬНОГО АНЕСТЕЗИОЛОГОМ-РЕАНИМАТОЛОГОМ], [КОРОНАРОГРАФИЯ РЕЗУЛЬТАТ], [ДИАГНОЗ СТАЦИОНАРНЫЙ])
    ) AS PivotTable
),

cte2 AS (
    SELECT
        oaw.Эпизод_хэш,
        oaw.Код_теста,
        oaw.Значение_число,
        ROW_NUMBER() OVER (PARTITION BY oaw.Эпизод_хэш, oaw.Код_теста ORDER BY oaw.Дата_время_авторизации_результата) AS rn
    FROM almaz_wh.dbo.obj_analyz_wh AS oaw
    JOIN #my_temp_test_codes ttc ON oaw.Код_теста = ttc.Код_теста
),

cte3 AS (
    SELECT *
    FROM (
        SELECT
            cte2.Эпизод_хэш,
            ttc.ColumnName,
            cte2.Значение_число
        FROM cte2
        JOIN #my_temp_test_codes ttc ON cte2.Код_теста = ttc.Код_теста AND cte2.rn = ttc.rn
    ) AS SourceTable
    PIVOT (
        MAX(Значение_число)
        FOR ColumnName IN ([Тропонин_1], [Тропонин_2], [ЛПВП], [ЛПОНП], [ЛПНП], [ХС_общ], [СКФ], [креат], [СРБ], [Глюкоза], [Баз_абс], [Баз_отн], [Эоз_абс], [Эоз_отн], [Моно_абс], [Моно_отн],
            [Лимф_абс], [Лимф_отн], [нейтр_абс], [нейтр_отн], [WBC], [PCT], [PDW], [MPV], [PLT], [RDW_SD], [RDW], [HCT], [MCHC], [MCH], [MCV], [RBC], [Hb])
    ) AS PivotTable
)

SELECT
    oew.Номер_эпизода,
    oew.Дата_поступления,
    oew.Клинический_диагноз_рубрика,
    oew.Исход_эпизода,
    oew.Результат_лечения,
    oew.Эпизод_хэш,
    oew.Пациент_хэш,
    opw.Регистрационный_номер,
    opw.Пол,
    opw.Дата_рождения,
    opw.Дата_смерти,
    status_pivot.[ЭХОКАРДИОГРАФИЧЕСКОЕ ИССЛЕДОВАНИЕ РЕЗУЛЬТАТ],
    status_pivot.[ПРОТОКОЛ ОПЕРАЦИИ],
    status_pivot.[ЭКГ РЕЗУЛЬТАТ],
    status_pivot.[ОСМОТР БОЛЬНОГО АНЕСТЕЗИОЛОГОМ-РЕАНИМАТОЛОГОМ],
    status_pivot.[КОРОНАРОГРАФИЯ РЕЗУЛЬТАТ],
    status_pivot.[ДИАГНОЗ СТАЦИОНАРНЫЙ],
    cte3.[Тропонин_1],
    cte3.[Тропонин_2],
    cte3.[ЛПВП],
    cte3.[ЛПОНП],
    cte3.[ЛПНП],
    cte3.[ХС_общ],
    cte3.[СКФ],
    cte3.[креат],
    cte3.[СРБ],
    cte3.[Глюкоза],
    cte3.[Баз_абс],
    cte3.[Баз_отн],
    cte3.[Эоз_абс],
    cte3.[Эоз_отн],
    cte3.[Моно_абс],
    cte3.[Моно_отн],
    cte3.[Лимф_абс],
    cte3.[Лимф_отн],
    cte3.[нейтр_абс],
    cte3.[нейтр_отн],
    cte3.[WBC],
    cte3.[PCT],
    cte3.[PDW],
    cte3.[MPV],
    cte3.[PLT],
    cte3.[RDW_SD],
    cte3.[RDW],
    cte3.[HCT],
    cte3.[MCHC],
    cte3.[MCH],
    cte3.[MCV],
    cte3.[RBC],
    cte3.[Hb]
FROM almaz_wh.dbo.obj_epizod_wh oew
JOIN cte3 ON oew.Эпизод_хэш = cte3.Эпизод_хэш
JOIN status_pivot ON oew.Пациент_хэш = status_pivot.Пациент_хэш
JOIN almaz_wh.dbo.obj_patient_wh opw ON oew.Пациент_хэш = opw.Пациент_хэш
WHERE oew.Дата_поступления BETWEEN '2019-01-01' AND '2021-12-31'
AND opw.Дата_рождения <= '2001-01-01'
AND (oew.Клинический_диагноз_рубрика like '%I20.0%' OR oew.Клинический_диагноз_рубрика like '%I20.1%' OR oew.Клинический_диагноз_рубрика like '%I21.4%' OR 	oew.Клинический_диагноз_рубрика like '%I21.9%' OR
	oew.Клинический_диагноз_рубрика like '%I22%' OR oew.Клинический_диагноз_рубрика like '%I23%');
